app/controllers/cards_controller.rb

INSERT INTO `cards` (`card_id`, `template_category`, `display_receipient_name`, `display_sender_message`, `display_sender_name`, `sender_username`, `card_status`, `created_at`, `updated_at`) VALUES ('2015-11-28 20:07:17 -0800', 'birthday', 'sai', 'Blah', 'leo', 'leo@outlook.com', 'Just Created', '2015-11-29 04:07:17', '2015-11-29 04:07:17')
---
  def makeTemplate
    card = (Time.now).to_s
    status = "Just Created"
    template = Card.create(card_id: card,
                           template_category: params[:template_category],
                           custom_conf: params[:canvas_data],
                           display_receipient_name: params[:display_receipient_name],
                           display_sender_message: params[:display_sender_message],
                           display_sender_name: params[:display_sender_name],
                           sender_username: session[:username],
                           card_status: status)