app/controllers/orders_controller.rb

SELECT  `cards`.* FROM `cards` WHERE `cards`.`card_status` = 'Just Created' AND `cards`.`sender_username` = 'leo@outlook.com' LIMIT 1
INSERT INTO `orders` (`sender_username`, `receiver_name`, `receiver_email`, `receiver_phone`, `card_id`, `amount`, `created_at`, `updated_at`) VALUES ('vrcooldude69@gmail.com', 'saideepak', 'saideepak09@awesome.com', 510516, '4c656860-6514-4701-841c-9545b9d7ffe4', 100, '2015-12-01 07:06:30', '2015-12-01 07:06:30')
---
  def place_order

    #TODO: Currently only one card per order, make the order have provisions for multiple card orders.

    temp = Card.where(card_status: "Just Created", sender_username: session[:username]).limit(1)
    @id = nil
    @net = 0

    puts "*****************************"
    temp.each do |r|
      @id = r.card_id
      # @net += r.amount
    end
    puts "*****************************"
    giftcard = @id#Get giftcard id (reference to the template), by querying using the session id.

    order = Order.create(receiver_name: params[:receiver_name],
                         receiver_email: params[:receiver_email],
                         receiver_phone: params[:receiver_phone],
                         card_id: giftcard,
                         amount: params[:amount])