app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `password`, `email`, `phone`, `balance`, `created_at`, `updated_at`) VALUES ('raj', 'timepass', 'vrcooldude69@gmail.com', 5105, '0', '2015-12-01 07:02:34', '2015-12-01 07:02:34')
---
  def signup
    user = User.create(name: params[:name], password: params[:password], email: params[:email], phone: params[:phone])

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'saideepak09@gmail.com' AND `users`.`password` = 'sai'
---
  def login
    email = params[:email]
    password = params[:password]
    result = User.where(email: email, password: password)